# Pandas Practice

This notebook is dedicated to practicing different tasks with pandas. The solutions are available in a solutions notebook, however, you should always try to figure them out yourself first.

It should be noted there may be more than one different way to answer a question or complete an exercise.

Exercises are based off (and directly taken from) the quick introduction to pandas notebook.

Different tasks will be detailed by comments or text.

For further reference and resources, it's advised to check out the [pandas documentation](https://pandas.pydata.org/pandas-docs/stable/).

In [1]:
# Import pandas
import pandas as pd

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_12064\3422465919.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [2]:
# Create a series of three different colours
colors = pd.Series(["red", "blue", "green"])
colors

0      red
1     blue
2    green
dtype: object

In [3]:
# View the series of different colours
print(colors)

0      red
1     blue
2    green
dtype: object

In [4]:
# Create a series of three different car types and view it
cars = pd.Series(["g63", "urus", "maybach"])
cars

0        g63
1       urus
2    maybach
dtype: object

In [5]:
# Combine the Series of cars and colours into a DataFrame
df = pd.DataFrame({"cars": cars, "colors": colors})
df

      cars colors
0      g63    red
1     urus   blue
2  maybach  green

In [6]:
# Import "../data/car-sales.csv" and turn it into a DataFrame
dataset = pd.read_csv("./car-sales.csv")
dataset

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

**Note:** Since you've imported `../data/car-sales.csv` as a DataFrame, we'll now refer to this DataFrame as 'the car sales DataFrame'.

In [7]:
# Export the DataFrame you created to a .csv file
dataset.to_csv("abc.csv")

In [8]:
# Find the different datatypes of the car data DataFrame
dataset.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [9]:
# Describe your current car sales DataFrame using describe()
dataset.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

In [10]:
# Get information about your DataFrame using info()
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 532.0+ bytes

What does it show you?

In [11]:
# Create a Series of different numbers and find the mean of them
numbers = pd.Series([1,2,3,4,5,6,7])
numbers.mean()

4.0

In [12]:
# Create a Series of different numbers and find the sum of them
numbers.sum()

28

In [13]:
# List out all the column names of the car sales DataFrame
dataset.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [14]:
# Find the length of the car sales DataFrame
len(dataset)

10

In [15]:
# Show the first 5 rows of the car sales DataFrame
dataset.head(5)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00

In [16]:
# Show the first 7 rows of the car sales DataFrame
dataset.head(7)

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00

In [17]:
# Show the bottom 5 rows of the car sales DataFrame
dataset.tail(5)

     Make Colour  Odometer (KM)  Doors      Price
5  Toyota  Green          99213      4  $4,500.00
6   Honda   Blue          45698      4  $7,500.00
7   Honda   Blue          54738      4  $7,000.00
8  Toyota  White          60000      4  $6,250.00
9  Nissan  White          31600      4  $9,700.00

In [18]:
# Use .loc to select the row at index 3 of the car sales DataFrame
dataset.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [19]:
# Use .iloc to select the row at position 3 of the car sales DataFrame
dataset.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

Notice how they're the same? Why do you think this is? 

Check the pandas documentation for [.loc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html) and [.iloc](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html). Think about a different situation each could be used for and try them out.

- iloc locate using row index
- loc locate using row label
- this cas the label is the index:

In [20]:
# Select the "Odometer (KM)" column from the car sales DataFrame
dataset.loc[:,"Odometer (KM)"]

0    150043
1     87899
2     32549
3     11179
4    213095
5     99213
6     45698
7     54738
8     60000
9     31600
Name: Odometer (KM), dtype: int64

In [21]:
# Find the mean of the "Odometer (KM)" column in the car sales DataFrame
dataset.loc[:,"Odometer (KM)"].mean()

78601.4

In [22]:
# Select the rows with over 100,000 kilometers on the Odometer
dataset.iloc[list(dataset.loc[:,"Odometer (KM)"] > 100000)]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
4  Nissan  White         213095      4  $3,500.00

In [23]:
# Create a crosstab of the Make and Doors columns
pd.crosstab(dataset["Doors"], dataset["Make"])

Make   BMW  Honda  Nissan  Toyota
Doors
3        0      0       0       1
4        0      3       2       3
5        1      0       0       0

In [24]:
# Group columns of the car sales DataFrame by the Make column and find the average
dataset.groupby("Make")["Doors"].mean()

Make
BMW       5.00
Honda     4.00
Nissan    4.00
Toyota    3.75
Name: Doors, dtype: float64

In [25]:
# Remove the punctuation from price column
dataset["Price"] = dataset["Price"].apply(lambda x: "".join(x[1:-3].split(","))).astype(dtype="int32")
dataset.head(3)

     Make Colour  Odometer (KM)  Doors  Price
0  Toyota  White         150043      4   4000
1   Honda    Red          87899      4   5000
2  Toyota   Blue          32549      3   7000

In [26]:
# Check the changes to the price column
dataset["Price"]

0     4000
1     5000
2     7000
3    22000
4     3500
5     4500
6     7500
7     7000
8     6250
9     9700
Name: Price, dtype: int32

In [27]:
# Remove the two extra zeros at the end of the price column
# Done

In [28]:
# Check the changes to the Price column
# Done

In [29]:
# Change the datatype of the Price column to integers
# Done

In [30]:
# Lower the strings of the Make column
dataset["Make"].apply(str.lower)

0    toyota
1     honda
2    toyota
3       bmw
4    nissan
5    toyota
6     honda
7     honda
8    toyota
9    nissan
Name: Make, dtype: object

If you check the car sales DataFrame, you'll notice the Make column hasn't been lowered.

How could you make these changes permanent?

Try it out.

In [31]:
# Make lowering the case of the Make column permanent
dataset["Make"] = dataset["Make"].apply(str.lower)

In [32]:
# Check the car sales DataFrame
dataset

     Make Colour  Odometer (KM)  Doors  Price
0  toyota  White         150043      4   4000
1   honda    Red          87899      4   5000
2  toyota   Blue          32549      3   7000
3     bmw  Black          11179      5  22000
4  nissan  White         213095      4   3500
5  toyota  Green          99213      4   4500
6   honda   Blue          45698      4   7500
7   honda   Blue          54738      4   7000
8  toyota  White          60000      4   6250
9  nissan  White          31600      4   9700

Notice how the Make column stays lowered after reassigning.

Now let's deal with missing data.

In [46]:
# Import the car sales DataFrame with missing data ("../data/car-sales-missing-data.csv")
data_missing = pd.read_csv("car-sales-missing-data.csv")
# Check out the new DataFrame
data_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

Notice the missing values are represented as `NaN` in pandas DataFrames.

Let's try fill them.

In [73]:
# Fill the Odometer column missing values with the mean of the column inplace
good_rows = data_missing["Odometer"].dropna()
mean_val_odor = good_rows.mean()
missing_rows = data_missing.iloc[list(data_missing["Odometer"].isna())]
good_rows

0    150043.0
1     87899.0
3     11179.0
4    213095.0
8     60000.0
9     31600.0
Name: Odometer, dtype: float64

In [63]:
# View the car sales missing DataFrame and verify the changes
data_missing

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [36]:
# Remove the rest of the missing data inplace

In [37]:
# Verify the missing values are removed by viewing the DataFrame

We'll now start to add columns to our DataFrame.

In [38]:
# Create a "Seats" column where every row has a value of 5

In [39]:
# Create a column called "Engine Size" with random values between 1.3 and 4.5
# Remember: If you're doing it from a Python list, the list has to be the same length
# as the DataFrame

In [40]:
# Create a column which represents the price of a car per kilometer
# Then view the DataFrame

In [41]:
# Remove the last column you added using .drop()

In [42]:
# Shuffle the DataFrame using sample() with the frac parameter set to 1
# Save the the shuffled DataFrame to a new variable

Notice how the index numbers get moved around. The [`sample()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.sample.html) function is a great way to get random samples from your DataFrame. It's also another great way to shuffle the rows by setting `frac=1`.

In [43]:
# Reset the indexes of the shuffled DataFrame

Notice the index numbers have been changed to have order (start from 0).

In [44]:
# Change the Odometer values from kilometers to miles using a Lambda function
# Then view the DataFrame

In [45]:
# Change the title of the Odometer (KM) to represent miles instead of kilometers

## Extensions

For more exercises, check out the pandas documentation, particularly the [10-minutes to pandas section](https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html). 

One great exercise would be to retype out the entire section into a Jupyter Notebook of your own.

Get hands-on with the code and see what it does.

The next place you should check out are the [top questions and answers on Stack Overflow for pandas](https://stackoverflow.com/questions/tagged/pandas?sort=MostVotes&edited=true). Often, these contain some of the most useful and common pandas functions. Be sure to play around with the different filters!

Finally, always remember, the best way to learn something new to is try it. Make mistakes. Ask questions, get things wrong, take note of the things you do most often. And don't worry if you keep making the same mistake, pandas has many ways to do the same thing and is a big library. So it'll likely take a while before you get the hang of it.